# 1. Користувач вводить з клавіатури два числа. Необхідно знайти суму чисел, різницю чисел, добуток чисел. Результат обчислень вивести на екран.
first = float(input("Введіть перше число: "))
second = float(input("Введіть друге число: "))
print(first + second)
print(first - second)
print(first * second)

# 2. Користувач вводить з клавіатури два числа. Перше число — це значення, друге число — відсоток, який потрібно порахувати. Треба вивести на екран відсоток від першого числа.
number = float(input("Введіть число: "))
percent = float(input("Введіть відсоток, який потрібно порахувати: "))
print(f"{percent}% від {number} = {(percent / 100) * number}")

# 3. Напишіть програму, яка обчислює площу прямокутника. Користувач з клавіатури вводить ширину та довжину прямокутника.
width = float(input("Введіть ширину: "))
length = float(input("Введіть довжину: "))
print("Площа прямокутника: ", width * length )

# 4. Користувач вводить з клавіатури температуру по шкалі Цельсія. Треба перевести температуру в градуси по Фаренгейту і вивести на екран.
celsius = float(input("Введіть температуру по шкалі Цельсія: "))
print("Градуси по Фаренгейту: ", 9/5 * celsius + 32)

# 5. Напишіть програму, яка знаходить середнє арифметичне значення трьох введених дробових чисел.
one = float(input("Введіть перше число: "))
two = float(input("Введіть друге число: "))
three = float(input("Введіть третє число: "))
print("Середнє арифметичне: ", (one+two+three)/3)

# 6. Користувач вводить число та ступінь. Програма обчислює вказану ступінь цього числа.
number = float(input("Введіть число: "))
degree = float(input("Введіть ступінь: "))
print("Ступінь числа: ", number ** degree)

# 7. Напишіть програму, яка пропонує користувачеві ввести радіус окружності, а потім обчислює площу та довжину цієї окружності. Число Pi задається в програмі як дійсна константа.
Pi = 3.141592653589793
R = float(input("Введіть радіус окружності: "))
print("Площа окружності: ", Pi * R ** 2)
print("Довжина окружності:", 2 * Pi * R)

# 8. Напишіть програму, яка надає користувачеві можливість ввести з клавіатури кількість гривень і переводить цю кількість у долари, євро та біткоїни.
#USD = 0.024
#EUR = 0.023
#BTC = 0.0000002
amount = float(input("Введіть кількість гривень: "))
print("Кількість USD: ",amount*0.024)
print("Кількість EUR: ",amount*0.023)
print("Кількість BTC: ",amount*0.0000002)

# 9. Напишіть програму, яка переводить кілометри в сухопутні та морські милі.
#land mile = 0.621371192 км
#nautical mile = 0.539956803 км
kilometers = float(input("Введіть кількість кілометрів: "))
print(f"{kilometers} км = {kilometers*0.621371192} сухопутних миль")
print(f"{kilometers} км = {kilometers*0.539956803} морських миль")

# 10. Поміняти місцями значення змінних a і b, спочатку за допомогою додаткової третьої змінної, а потім без.
a = 1
b = 2
# Додаткова третя змінна:
temp = a
a = b
b = temp
print("a:", a)
print("b:", b)
# Без третьої змінної:
a = 1
b = 2
a, b = b, a
print("a:", a)
print("b:", b)

# 11. Ввести з клавіатури тризначне число та «перевернути» його.
number = input("Введіть тризначне число: ")
reversed_number = number[::-1]
print("Перевернуте число:", reversed_number)

# 12. Ввести з клавіатури тризначне число та видалити з нього середню цифру.
number = input("Введіть тризначне число: ")
print("Число після видалення середньої цифри:", number[0] + number[2])
